---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorReinforcementArea
source: html/cbcc7e28-2405-e3c1-6f0b-1bfafb103509.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorReinforcementArea Property

The area of fabric divided by the spacing of the wire in the major direction.
 This method does not apply to custom fabric sheet

## Syntax (C#)
```csharp
public double MajorReinforcementArea { get; }
```